# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

k = int(input("Введите k: "))
i = 0
h0 = 0
h1 = 1
fib = []
fib.append(0)
while i < k - 1:
    h = h0 + h1 
    fib.append(h)
    fib= [h*-1] + fib
    h0=h1
    h1=h
    i = i + 1
print(fib)