# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

k = int(input("Введите k: "))
i = 0
h0 = 0
h1 = 1
fib = []
fib.append(0)
fib.append(1)
while i < k - 1:
    h = h0 + h1 
    fib.append(h)
    h0=h1
    h1=h
    i = i + 1

fibi= []
i=-1
h1=1
h0=0
while (0 > i > k*-1-1):
    h = h1 - h0 
    fibi.insert(0,h)
    h1=h0
    h0=h
    i = i - 1
res=fibi+fib
print(res)
